header.menu.admin.model.manager.label=Qu\u1ea3n l\u00fd Model

cmm.page.title=Qu\u1ea3n l\u00fd Model

cmm.intro.1=Model \u0111\u01b0\u1ee3c d\u00f9ng \u0111\u1ec3 qu\u1ea3n l\u00fd c\u00e1c t\u00f9y ch\u1ec9nh v\u00e0 di\u1ec7n m\u1ea1o.
cmm.intro.2=B\u1ea1n c\u00f3 th\u1ec3 t\u1ea1o ra m\u1ed9t model m\u1edbi, ho\u1eb7c ch\u1ecdn m\u1ed9t t\u00ean model s\u1eb5n c\u00f3, t\u1ea1o ra v\u00e0 xem k\u1ebft h\u1ee3p c\u00e1c lo\u1ea1i t\u00f9y ch\u1ec9nh v\u00e0 di\u1ec7n m\u1ea1o.
cmm.intro.editor1=S\u1eed d\u1ee5ng thi\u1ebft k\u1ebf b\u1ed1 tr\u00ed \u0111\u1ec3 x\u00e1c \u0111\u1ecbnh c\u00e1ch hi\u1ec3n th\u1ecb thu\u1ed9c t\u00ednh b\u1ea1n t\u1ea1o.

cmm.message.no-models=Kh\u00f4ng c\u00f3 models c\u00f3 s\u1eb5n
cmm.message.no-types=Kh\u00f4ng c\u00f3 types s\u1eb5n c\u00f3
cmm.message.no-propertygroups=Kh\u00f4ng c\u00f3 kh\u00eda c\u1ea1nh s\u1eb5n c\u00f3
cmm.message.no-properties=Kh\u00f4ng c\u00f3 thu\u1ed9c t\u00ednh s\u1eb5n c\u00f3

cmm.heading.properties=Thu\u1ed9c t\u00ednh
cmm.heading.create-model-menu=T\u1ea1o Model
cmm.heading.existing-models=M\u00f4 h\u00ecnh
cmm.heading.models=M\u00f4 h\u00ecnh
cmm.heading.types=Types T\u00f9y ch\u1ec9nh
cmm.heading.propertygroups=C\u00e1c kh\u00eda c\u1ea1nh
cmm.heading.create-property-menu=T\u1ea1o thu\u1ed9c t\u00ednh

cmm.label.status.draft=Model cha kh\u00f4ng ho\u1ea1t \u0111\u1ed9ng
cmm.label.status.active=Model cha ho\u1ea1t \u0111\u1ed9ng
cmm.label.status.grid.draft=Kh\u00f4ng ho\u1ea1t \u0111\u1ed9ng
cmm.label.status.grid.active=Ho\u1ea1t \u0111\u1ed9ng

cmm.header.name=T\u00ean
cmm.header.namespace=Namespace
cmm.header.display-label=Nh\u00e3n hi\u1ec3n th\u1ecb
cmm.header.status=T\u00ecnh tr\u1ea1ng
cmm.header.parent=Parent
cmm.header.actions=H\u00e0nh \u0111\u1ed9ng
cmm.header.type=Lo\u1ea1i d\u1eef li\u1ec7u
cmm.header.multivalue=\u0110a gi\u00e1 tr\u1ecb
cmm.header.defaultvalue=Gi\u00e1 tr\u1ecb m\u1eb7c \u0111\u1ecbnh
cmm.header.mandatory=Y\u00eau c\u1ea7u
cmm.header.layout=B\u1ed1 tr\u00ed
cmm.header.form-layout=Khu v\u1ef1c b\u1ed1 tr\u00ed

cmm.message.none=Kh\u00f4ng c\u00f3
cmm.message.error-loading-models=C\u00f3 m\u1ed9t v\u1ea5n \u0111\u1ec1 nh\u1eadn \u0111\u01b0\u1ee3c m\u00f4 h\u00ecnh t\u1eeb h\u1ec7 th\u1ed1ng. H\u00e3y th\u1eed l\u00e0m m\u1edbi tr\u00ecnh duy\u1ec7t c\u1ee7a b\u1ea1n.
cmm.message.no-models-found=Kh\u00f4ng t\u00ecm th\u1ea5y m\u00f4 h\u00ecnh. Nh\u1ea5p v\u00e0o T\u1ea1o m\u00f4 h\u00ecnh \u0111\u1ec3 b\u1eaft \u0111\u1ea7u.
cmm.message.error-loading-types=C\u00f3 m\u1ed9t v\u1ea5n \u0111\u1ec1 nh\u1eadn c\u00e1c lo\u1ea1i t\u1eeb h\u1ec7 th\u1ed1ng. H\u00e3y th\u1eed l\u00e0m m\u1edbi tr\u00ecnh duy\u1ec7t c\u1ee7a b\u1ea1n.
cmm.message.no-types-found=Kh\u00f4ng t\u00ecm th\u1ea5y lo\u1ea1i n\u00e0o. Nh\u1ea5p v\u00e0o T\u1ea1o Lo\u1ea1i t\u00f9y ch\u1ec9nh \u0111\u1ec3 b\u1eaft \u0111\u1ea7u.
cmm.message.error-loading-property-groups=C\u00f3 m\u1ed9t v\u1ea5n \u0111\u1ec1 nh\u1eadn \u0111\u01b0\u1ee3c c\u00e1c kh\u00eda c\u1ea1nh t\u1eeb h\u1ec7 th\u1ed1ng. H\u00e3y th\u1eed l\u00e0m m\u1edbi tr\u00ecnh duy\u1ec7t c\u1ee7a b\u1ea1n.
cmm.message.no-property-groups-found=Kh\u00f4ng t\u00ecm th\u1ea5y kh\u00eda c\u1ea1nh n\u00e0o. Nh\u1ea5p v\u00e0o T\u1ea1o kh\u00eda c\u1ea1nh \u0111\u1ec3 b\u1eaft \u0111\u1ea7u.
cmm.message.unknown-error=M\u1ed9t v\u1ea5n \u0111\u1ec1 ch\u01b0a bi\u1ebft \u0111\u00e3 x\u1ea3y ra. H\u00e3y th\u1eed l\u00e0m m\u1edbi tr\u00ecnh duy\u1ec7t c\u1ee7a b\u1ea1n.
cmm.message.no-properties-found=Kh\u00f4ng t\u00ecm th\u1ea5y t\u00e0i s\u1ea3n. Nh\u1ea5p v\u00e0o T\u1ea1o t\u00e0i s\u1ea3n \u0111\u1ec3 b\u1eaft \u0111\u1ea7u.
cmm.message.error-loading-properties=C\u00f3 m\u1ed9t v\u1ea5n \u0111\u1ec1 nh\u1eadn t\u00e0i s\u1ea3n t\u1eeb h\u1ec7 th\u1ed1ng. H\u00e3y th\u1eed l\u00e0m m\u1edbi tr\u00ecnh duy\u1ec7t c\u1ee7a b\u1ea1n.
cmm.message.download-status-error=\u0110\u00e3 x\u1ea3y ra s\u1ef1 c\u1ed1 khi t\u1ea3i xu\u1ed1ng t\u1ec7p Xu\u1ea5t m\u00f4 h\u00ecnh. H\u00e3y th\u1eed t\u1ea3i l\u1ea1i t\u1ec7p.
cmm.message.error-import=C\u00f3 m\u1ed9t v\u1ea5n \u0111\u1ec1 nh\u1eadp t\u1ec7p. Ch\u1ec9 c\u00e1c t\u1ec7p Xu\u1ea5t m\u00f4 h\u00ecnh \u0111\u01b0\u1ee3c h\u1ed7 tr\u1ee3. Ki\u1ec3m tra lo\u1ea1i t\u1ec7p v\u00e0 th\u1eed l\u1ea1i.
cmm.message.error-conflict=C\u00f3 m\u1ed9t v\u1ea5n \u0111\u1ec1 nh\u1eadp t\u1ec7p. H\u00e3y th\u1eed lo\u1ea1i b\u1ecf m\u00f4 h\u00ecnh hi\u1ec7n c\u00f3 tr\u01b0\u1edbc khi nh\u1eadp m\u1ed9t m\u00f4 h\u00ecnh kh\u00e1c.

cmm.validation.alphanumeric-uri-mandatory=Ch\u1ec9 s\u1eed d\u1ee5ng s\u1ed1, ch\u1eef c\u00e1i v\u00e0 k\u00fd t\u1ef1 URI
cmm.validation.alphanumeric-mandatory=Ch\u1ec9 s\u1eed d\u1ee5ng s\u1ed1, ch\u1eef c\u00e1i, d\u1ea5u g\u1ea1ch n\u1ed1i (-) v\u00e0 d\u1ea5u g\u1ea1ch d\u01b0\u1edbi (_)
cmm.validation.alphanumeric-spaces=Ch\u1ec9 s\u1eed d\u1ee5ng s\u1ed1, ch\u1eef c\u00e1i, d\u1ea5u g\u1ea1ch n\u1ed1i (-) v\u00e0 d\u1ea5u g\u1ea1ch d\u01b0\u1edbi (_)
cmm.validation.maxlength255=Qu\u00e1 nhi\u1ec1u nh\u00e2n v\u1eadt
cmm.validation.maxlength1024=Qu\u00e1 nhi\u1ec1u nh\u00e2n v\u1eadt

cmm.button.back-to-models=<< Hi\u1ec3n th\u1ecb m\u00f4 h\u00ecnh
cmm.button.back-to-types-propertygroups=<< Hi\u1ec3n th\u1ecb lo\u1ea1i v\u00e0 kh\u00eda c\u1ea1nh
cmm.button.cancel=H\u1ee7y b\u1ecf
cmm.button.create=T\u1ea1o
cmm.button.create-and-another=T\u1ea1o v\u00e0 th\u00eam c\u00e1i kh\u00e1c
cmm.button.edit=Ch\u1ec9nh s\u1eeda
cmm.button.save-changes=L\u01b0u
cmm.button.activate=K\u00edch ho\u1ea1t
cmm.button.deactivate=V\u00f4 hi\u1ec7u h\u00f3a
cmm.button.delete=X\u00f3a
cmm.button.import=Nh\u1eadp kh\u1ea9u
cmm.button.export=Xu\u1ea5t kh\u1ea9u
cmm.button.form-editor=Tr\u00ecnh thi\u1ebft k\u1ebf b\u1ed1 tr\u00ed
cmm.button.editor-save-layout=L\u01b0u
cmm.button.editor-default-layout=\u00c1p d\u1ee5ng b\u1ed1 c\u1ee5c m\u1eb7c \u0111\u1ecbnh
cmm.button.editor-clear-layout=X\u00f3a
cmm.button.find-instances=T\u00ecm n\u01a1i s\u1eed d\u1ee5ng

cmm.select-fields.button.string=String
cmm.select-fields.button.number=S\u1ed1
cmm.select-fields.button.date=Ng\u00e0y
cmm.select-fields.button.date-time=Ng\u00e0y v\u00e0 th\u1eddi gian

cmm.import-button.model=M\u00f4 h\u00ecnh nh\u1eadp kh\u1ea9u
cmm.create-button.model=T\u1ea1o m\u00f4 h\u00ecnh
cmm.create-button.type=T\u1ea1o lo\u1ea1i t\u00f9y ch\u1ec9nh
cmm.create-button.propertygroup=T\u1ea1o kh\u00eda c\u1ea1nh
cmm.create-button.property=T\u1ea1o t\u00e0i s\u1ea3n

cmm.model.namespace=Namespace
cmm.model.namespace.info=Nh\u1eadp m\u1ed9t kh\u00f4ng gian t\u00ean m\u00f4 h\u00ecnh duy nh\u1ea5t. V\u00ed d\u1ee5: n\u1ebfu b\u1ea1n \u0111ang t\u1ea1o m\u00f4 h\u00ecnh cho c\u00e1c t\u00e0i li\u1ec7u t\u00e0i ch\u00ednh, b\u1ea1n c\u00f3 th\u1ec3 s\u1eed d\u1ee5ng URI t\u01b0\u01a1ng t\u1ef1 nh\u01b0 http \: //www.mycompany.com/model/finance/1.0.
cmm.model.prefix=Ti\u1ec1n t\u1ed1
cmm.model.prefix.info=Nh\u1eadp m\u1ed9t ti\u1ec1n t\u1ed1 kh\u00f4ng gian t\u00ean cho m\u00f4 h\u00ecnh. \u0110\u00e2y l\u00e0 vi\u1ebft t\u1eaft cho URI kh\u00f4ng gian t\u00ean v\u00e0 \u0111\u01b0\u1ee3c s\u1eed d\u1ee5ng l\u00e0m ti\u1ec1n t\u1ed1 kh\u00f4ng gian t\u00ean v\u00e0 cho c\u00fa ph\u00e1p thu\u1ed9c t\u00ednh t\u00ecm ki\u1ebfm n\u00e2ng cao.
cmm.model.name=T\u00ean
cmm.model.name.info=Nh\u1eadp t\u00ean cho m\u00f4 h\u00ecnh.
cmm.model.name.no.edit=B\u1ea1n kh\u00f4ng th\u1ec3 thay \u0111\u1ed5i t\u00ean c\u1ee7a m\u1ed9t m\u00f4 h\u00ecnh hi\u1ec7n c\u00f3.
cmm.model.description=M\u00f4 t\u1ea3
cmm.model.author=T\u00e1c gi\u1ea3
cmm.model.author.info=Nh\u1eadp m\u1ed9t ng\u01b0\u1eddi t\u1ea1o t\u00f9y ch\u1ecdn c\u1ee7a m\u00f4 h\u00ecnh.

cmm.model.select=Ch\u1ecdn
cmm.model.import.info=Ch\u1ecdn m\u1ed9t t\u1ec7p ZIP \u0111\u1ec3 nh\u1eadp. B\u1ea1n ch\u1ec9 c\u00f3 th\u1ec3 nh\u1eadp c\u00e1c t\u1ec7p ZIP \u0111\u00e3 \u0111\u01b0\u1ee3c xu\u1ea5t t\u1eeb Tr\u00ecnh qu\u1ea3n l\u00fd m\u00f4 h\u00ecnh.
cmm.model.import-title=Import M\u00f4 h\u00ecnh
cmm.model.create-title=T\u1ea1o m\u00f4 h\u00ecnh
cmm.model.edit-title=Ch\u1ec9nh s\u1eeda m\u00f4 h\u00ecnh
cmm.model.create-type-title=T\u1ea1o lo\u1ea1i t\u00f9y ch\u1ec9nh
cmm.model.edit-type-title=Ch\u1ec9nh s\u1eeda lo\u1ea1i t\u00f9y ch\u1ec9nh
cmm.model.create-propertygroup-title=T\u1ea1o kh\u00eda c\u1ea1nh
cmm.model.edit-propertygroup-title=Ch\u1ec9nh s\u1eeda kh\u00eda c\u1ea1nh
cmm.model.title=Nh\u00e3n hi\u1ec3n th\u1ecb
cmm.model.parent.type=Ki\u1ec3u ph\u1ee5 huynh
cmm.model.parent.propertygroup=Kh\u00eda c\u1ea1nh ph\u1ee5 huynh

cmm.type.name=T\u00ean lo\u1ea1i
cmm.type.name.info=Nh\u1eadp t\u00ean cho lo\u1ea1i. \u0110i\u1ec1u n\u00e0y s\u1ebd t\u1ef1 \u0111\u1ed9ng ti\u1ec1n t\u1ed1 kh\u00f4ng gian t\u00ean m\u00f4 h\u00ecnh.
cmm.type.name.no.edit=B\u1ea1n kh\u00f4ng th\u1ec3 thay \u0111\u1ed5i t\u00ean c\u1ee7a m\u1ed9t lo\u1ea1i hi\u1ec7n c\u00f3.
cmm.type.title.info=Nh\u1eadp nh\u00e3n hi\u1ec3n th\u1ecb cho lo\u1ea1i.
cmm.type.parent.info=Ch\u1ecdn lo\u1ea1i cha. Ki\u1ec3u t\u00f9y ch\u1ec9nh k\u1ebf th\u1eeba t\u1ea5t c\u1ea3 c\u00e1c thu\u1ed9c t\u00ednh v\u00e0 c\u00e1c kh\u00eda c\u1ea1nh \u0111\u01b0\u1ee3c g\u00e1n cho cha m\u1eb9.
cmm.type.parent.no.edit=B\u1ea1n kh\u00f4ng th\u1ec3 thay \u0111\u1ed5i lo\u1ea1i cha m\u1eb9 c\u1ee7a m\u1ed9t lo\u1ea1i trong m\u1ed9t m\u00f4 h\u00ecnh ho\u1ea1t \u0111\u1ed9ng.

cmm.propertygroup.name=T\u00ean kh\u00eda c\u1ea1nh
cmm.propertygroup.name.info=Nh\u1eadp t\u00ean cho kh\u00eda c\u1ea1nh. \u0110i\u1ec1u n\u00e0y s\u1ebd t\u1ef1 \u0111\u1ed9ng ti\u1ec1n t\u1ed1 kh\u00f4ng gian t\u00ean m\u00f4 h\u00ecnh.
cmm.propertygroup.name.no.edit=B\u1ea1n kh\u00f4ng th\u1ec3 thay \u0111\u1ed5i t\u00ean c\u1ee7a m\u1ed9t kh\u00eda c\u1ea1nh hi\u1ec7n c\u00f3.
cmm.propertygroup.title.info=Nh\u1eadp nh\u00e3n hi\u1ec3n th\u1ecb cho c\u00e1c kh\u00eda c\u1ea1nh.
cmm.propertygroup.parent.info=Ch\u1ecdn m\u1ed9t kh\u00eda c\u1ea1nh cha m\u1eb9 t\u00f9y ch\u1ecdn. C\u00e1c kh\u00eda c\u1ea1nh k\u1ebf th\u1eeba t\u1ea5t c\u1ea3 c\u00e1c thu\u1ed9c t\u00ednh v\u00e0 c\u00e1c kh\u00eda c\u1ea1nh \u0111\u01b0\u1ee3c g\u00e1n cho cha m\u1eb9.
cmm.propertygroup.parent.no.edit=B\u1ea1n kh\u00f4ng th\u1ec3 thay \u0111\u1ed5i kh\u00eda c\u1ea1nh cha m\u1eb9 c\u1ee7a m\u1ed9t kh\u00eda c\u1ea1nh trong m\u1ed9t m\u00f4 h\u00ecnh ho\u1ea1t \u0111\u1ed9ng.

cmm.property.create-title=T\u1ea1o t\u00e0i s\u1ea3n
cmm.property.edit-title=Ch\u1ec9nh s\u1eeda t\u00e0i s\u1ea3n
cmm.property.name.info=Nh\u1eadp t\u00ean cho t\u00e0i s\u1ea3n. \u0110i\u1ec1u n\u00e0y s\u1ebd t\u1ef1 \u0111\u1ed9ng ti\u1ec1n t\u1ed1 kh\u00f4ng gian t\u00ean m\u00f4 h\u00ecnh.
cmm.property.name.no.edit=B\u1ea1n kh\u00f4ng th\u1ec3 thay \u0111\u1ed5i t\u00ean c\u1ee7a m\u1ed9t t\u00e0i s\u1ea3n hi\u1ec7n c\u00f3.
cmm.property.title.info=Nh\u1eadp nh\u00e3n hi\u1ec3n th\u1ecb cho t\u00e0i s\u1ea3n.
cmm.property.mandatory=Y\u00eau c\u1ea7u
cmm.property.mandatory.info=Ch\u1ecdn n\u1ebfu gi\u00e1 tr\u1ecb thu\u1ed9c t\u00ednh l\u00e0 t\u00f9y ch\u1ecdn ho\u1eb7c b\u1eaft bu\u1ed9c.
cmm.property.mandatory.no.edit=B\u1ea1n kh\u00f4ng th\u1ec3 thay \u0111\u1ed5i tr\u1ea1ng th\u00e1i b\u1eaft bu\u1ed9c c\u1ee7a m\u1ed9t t\u00e0i s\u1ea3n trong m\u1ed9t m\u00f4 h\u00ecnh ho\u1ea1t \u0111\u1ed9ng.
cmm.property.multiple=Nhi\u1ec1u
cmm.property.multiple.info=Ch\u1ecdn n\u1ebfu t\u00e0i s\u1ea3n n\u00ean \u0111\u01b0\u1ee3c \u0111a tr\u1ecb.
cmm.property.multiple.no.edit=B\u1ea1n kh\u00f4ng th\u1ec3 thay \u0111\u1ed5i tr\u1ea1ng th\u00e1i \u0111a gi\u00e1 tr\u1ecb c\u1ee7a m\u1ed9t t\u00e0i s\u1ea3n trong m\u1ed9t m\u00f4 h\u00ecnh ho\u1ea1t \u0111\u1ed9ng.
cmm.property.default=Gi\u00e1 tr\u1ecb m\u1eb7c \u0111\u1ecbnh
cmm.property.default.info=Nh\u1eadp m\u1ed9t gi\u00e1 tr\u1ecb m\u1eb7c \u0111\u1ecbnh cho thu\u1ed9c t\u00ednh n\u00e0y ph\u00f9 h\u1ee3p v\u1edbi lo\u1ea1i d\u1eef li\u1ec7u \u0111\u00e3 ch\u1ecdn.
cmm.property.default.number.error=Vui l\u00f2ng nh\u1eadp m\u1ed9t s\u1ed1 h\u1ee3p l\u1ec7
cmm.property.default.bool.true=\u0110\u00fang
cmm.property.default.bool.false=Sai
cmm.property.datatype=Lo\u1ea1i d\u1eef li\u1ec7u
cmm.property.datatype.info=Ch\u1ecdn ki\u1ec3u d\u1eef li\u1ec7u m\u00e0 thu\u1ed9c t\u00ednh n\u00e0y c\u00f3 th\u1ec3 ch\u1ee9a.
cmm.property.datatype.no.edit=B\u1ea1n kh\u00f4ng th\u1ec3 thay \u0111\u1ed5i ki\u1ec3u d\u1eef li\u1ec7u c\u1ee7a m\u1ed9t t\u00e0i s\u1ea3n trong m\u1ed9t m\u00f4 h\u00ecnh ho\u1ea1t \u0111\u1ed9ng.
cmm.property.constraint=H\u1ea1n ch\u1ebf
cmm.property.constraint.info=Ch\u1ecdn m\u1ed9t r\u00e0ng bu\u1ed9c t\u00f9y ch\u1ecdn cho t\u00e0i s\u1ea3n.
cmm.property.constraint.expression=C\u1ee5m t\u1eeb th\u00f4ng d\u1ee5ng
cmm.property.constraint.expression.info=Nh\u1eadp bi\u1ec3u th\u1ee9c ch\u00ednh quy \u0111\u1ec3 s\u1eed d\u1ee5ng nh\u01b0 m\u1ed9t r\u00e0ng bu\u1ed9c.
cmm.property.constraint.requires-match=Y\u00eau c\u1ea7u tr\u1eadn \u0111\u1ea5u
cmm.property.constraint.requires-match.info=L\u00e0 m\u1ed9t k\u1ebft h\u1ee3p c\u1ee7a bi\u1ec3u th\u1ee9c c\u1ea7n thi\u1ebft?
cmm.property.constraint.min-length=Chi\u1ec1u d\u00e0i t\u1ed1i thi\u1ec3u
cmm.property.constraint.min-length.info=Nh\u1eadp chi\u1ec1u d\u00e0i t\u1ed1i thi\u1ec3u \u0111\u01b0\u1ee3c ph\u00e9p cho t\u00e0i s\u1ea3n.
cmm.property.constraint.max-length=Chi\u1ec1u d\u00e0i t\u1ed1i \u0111a
cmm.property.constraint.max-length.info=Nh\u1eadp chi\u1ec1u d\u00e0i t\u1ed1i \u0111a \u0111\u01b0\u1ee3c ph\u00e9p cho t\u00e0i s\u1ea3n.
cmm.property.constraint.min-value=Gi\u00e1 tr\u1ecb t\u1ed1i thi\u1ec3u
cmm.property.constraint.min-value.info=Nh\u1eadp gi\u00e1 tr\u1ecb t\u1ed1i thi\u1ec3u \u0111\u01b0\u1ee3c ph\u00e9p cho t\u00e0i s\u1ea3n.
cmm.property.constraint.max-value=Gia tri\u0323 l\u01a1n nh\u00e2t
cmm.property.constraint.max-value.info=Nh\u1eadp gi\u00e1 tr\u1ecb t\u1ed1i \u0111a \u0111\u01b0\u1ee3c ph\u00e9p cho t\u00e0i s\u1ea3n.
cmm.property.constraint.allowed-values=Danh s\u00e1ch c\u00e1c gi\u00e1 tr\u1ecb
cmm.property.constraint.allowed-values.info=Nh\u1eadp danh s\u00e1ch c\u00e1c gi\u00e1 tr\u1ecb \u0111\u01b0\u1ee3c ph\u00e9p, v\u1edbi m\u1ed7i m\u1ee5c m\u1edbi tr\u00ean m\u1ed9t d\u00f2ng m\u1edbi.
cmm.property.constraint.sorted=S\u1eafp x\u1ebfp ch\u1eef v\u00e0 s\u1ed1
cmm.property.constraint.sorted.info=\ 
cmm.property.constraint.class=T\u00ean l\u1edbp
cmm.property.constraint.class.info=Nh\u1eadp t\u00ean \u0111\u1ee7 \u0111i\u1ec1u ki\u1ec7n c\u1ee7a l\u1edbp \u0111\u1ec3 s\u1eed d\u1ee5ng nh\u01b0 m\u1ed9t r\u00e0ng bu\u1ed9c.
cmm.property.indexing=L\u1eadp ch\u1ec9 m\u1ee5c
cmm.property.indexing.info=Ch\u1ecdn xem t\u00e0i s\u1ea3n c\u00f3 th\u1ec3 \u0111\u01b0\u1ee3c t\u00ecm ki\u1ebfm tr\u00ean v\u00e0 lo\u1ea1i t\u00ecm ki\u1ebfm n\u00e0o \u0111\u01b0\u1ee3c h\u1ed7 tr\u1ee3. S\u1eed d\u1ee5ng c\u00e1c t\u00f9y ch\u1ecdn V\u0103n b\u1ea3n c\u01a1 b\u1ea3n ho\u1eb7c mi\u1ec5n ph\u00ed tr\u1eeb khi b\u1ea1n c\u00f3 c\u00e1c y\u00eau c\u1ea7u n\u00e2ng cao c\u1ee5 th\u1ec3.
cmm.property.indexing.no.edit=cmm.property.indexing.text.none=Kh\u00f4ng c\u00f3
cmm.property.indexing.nontext.none=Kh\u00f4ng c\u00f3
cmm.property.indexing.nontext.basic=C\u0103n b\u1ea3n
cmm.property.indexing.nontext.enhanced=Enhanced Search
cmm.property.indexing.text.none=Kh\u00f4ng c\u00f3
cmm.property.indexing.text.standard=Ti\u00eau chu\u1ea9n
cmm.property.indexing.text.free=Free Text
cmm.property.indexing.text.list-whole=List of Values - Whole Match
cmm.property.indexing.text.list-partial=List of Values - Partial Match
cmm.property.indexing.text.pattern-unique=Pattern - Unique Matches
cmm.property.indexing.text.pattern-many=Pattern - Many Matches
cmm.property.indexing.txthelp=C\u00e1c t\u00f9y ch\u1ecdn l\u1eadp ch\u1ec9 m\u1ee5c kh\u1ea3 d\u1ee5ng t\u00f9y thu\u1ed9c v\u00e0o Lo\u1ea1i d\u1eef li\u1ec7u b\u1ea1n \u0111\u00e3 ch\u1ecdn. B\u1ea1n c\u00f3 th\u1ec3 ch\u1ecdn t\u1eeb c\u00e1c t\u00f9y ch\u1ecdn n\u00e0y \u0111\u1ec3 khi ng\u01b0\u1eddi d\u00f9ng th\u1ef1c hi\u1ec7n t\u00ecm ki\u1ebfm, thu\u1ed9c t\u00ednh \u0111\u01b0\u1ee3c bao g\u1ed3m nh\u01b0 m\u1ed9t ph\u1ea7n c\u1ee7a t\u00ecm ki\u1ebfm. <br /> <br /> <ul> <li> Ch\u1ecdn <strong> Kh\u00f4ng </ strong> \u0111\u1ec3 d\u1eebng thu\u1ed9c t\u00ednh c\u00f3 th\u1ec3 t\u00ecm ki\u1ebfm. </ li> <li> Ch\u1ecdn t\u00f9y ch\u1ecdn <strong> C\u01a1 b\u1ea3n </ strong> ho\u1eb7c <strong> V\u0103n b\u1ea3n mi\u1ec5n ph\u00ed </ strong> \u0111\u1ec3 l\u00e0m cho thu\u1ed9c t\u00ednh c\u00f3 th\u1ec3 t\u00ecm ki\u1ebfm \u0111\u01b0\u1ee3c. </ li> <li> Ch\u1ecdn t\u1eeb c\u00e1c t\u00f9y ch\u1ecdn kh\u00e1c \u0111\u1ec3 bi\u1ebft c\u00e1c t\u00f9y ch\u1ecdn l\u1eadp ch\u1ec9 m\u1ee5c n\u00e2ng cao h\u01a1n, bao g\u1ed3m kh\u1ea3 n\u0103ng c\u00f3 th\u1ec3 l\u1ecdc c\u00e1c t\u00ecm ki\u1ebfm b\u1eb1ng thu\u1ed9c t\u00ednh n\u00e0y. </ li> </ ul> <br /> Xem <a href \ = "http \: //docs.alfresco.com/ { 0} /t task/admintools-ct-properIES-create.html "target \ =" _ blank "> T\u1ea1o m\u1ed9t thu\u1ed9c t\u00ednh m\u1edbi cho c\u00e1c lo\u1ea1i v\u00e0 kh\u00eda c\u1ea1nh t\u00f9y ch\u1ec9nh </a> \u0111\u1ec3 bi\u1ebft th\u00eam.

cmm.property.mandatory.optional=Kh\u00f4ng b\u1eaft bu\u1ed9c
cmm.property.mandatory.mandatory-not-enforced=B\u1eaft bu\u1ed9c

cmm.property.constraint.options.none=Kh\u00f4ng c\u00f3
cmm.property.constraint.options.regex=Regular expression
cmm.property.constraint.options.length=Minimum / maximum length
cmm.property.constraint.options.minmax=Minimum / maximum value
cmm.property.constraint.options.list=Danh s\u00e1ch c\u00e1c gi\u00e1 tr\u1ecb
cmm.property.constraint.options.class=Java Class

cmm.model.delete-title=X\u00f3a m\u00f4 h\u00ecnh
cmm.model.delete-message=B\u1ea1n c\u00f3 ch\u1eafc ch\u1eafn mu\u1ed1n x\u00f3a m\u00f4 h\u00ecnh '' {0} '' kh\u00f4ng? T\u1ea5t c\u1ea3 c\u00e1c lo\u1ea1i t\u00f9y ch\u1ec9nh, c\u00e1c kh\u00eda c\u1ea1nh v\u00e0 thu\u1ed9c t\u00ednh trong m\u00f4 h\u00ecnh c\u0169ng s\u1ebd b\u1ecb x\u00f3a.
cmm.model.delete-button.confirm-label=X\u00f3a
cmm.model.delete-button.cancel-label=H\u1ee7y b\u1ecf

cmm.type.delete-title=X\u00f3a lo\u1ea1i t\u00f9y ch\u1ec9nh
cmm.type.delete-message=B\u1ea1n c\u00f3 ch\u1eafc ch\u1eafn mu\u1ed1n x\u00f3a lo\u1ea1i t\u00f9y ch\u1ec9nh '' {0} '' kh\u00f4ng? T\u1ea5t c\u1ea3 c\u00e1c thu\u1ed9c t\u00ednh trong lo\u1ea1i c\u0169ng s\u1ebd b\u1ecb x\u00f3a.

cmm.propertygroup.delete-title=X\u00f3a kh\u00eda c\u1ea1nh
cmm.propertygroup.delete-message=B\u1ea1n c\u00f3 ch\u1eafc ch\u1eafn mu\u1ed1n x\u00f3a kh\u00eda c\u1ea1nh '' {0} ''? T\u1ea5t c\u1ea3 c\u00e1c thu\u1ed9c t\u00ednh trong kh\u00eda c\u1ea1nh c\u0169ng s\u1ebd b\u1ecb x\u00f3a.

cmm.property.delete-title=X\u00f3a thu\u1ed9c t\u00ednh
cmm.property.delete-message=B\u1ea1n c\u00f3 ch\u1eafc ch\u1eafn mu\u1ed1n x\u00f3a thu\u1ed9c t\u00ednh '' {0} '' kh\u00f4ng?

cmm.cm_name=T\u00ean
cmm.cm_title=Ti\u00eau \u0111\u1ec1
cmm.cm_description=M\u00f4 t\u1ea3
cmm.cm_creator=T\u00e1c gi\u1ea3
cmm.cm_created=Ng\u00e0y t\u1ea1o
cmm.cm_modifier=Ng\u01b0\u1eddi s\u1eeda
cmm.cm_modified=Ng\u00e0y s\u1eeda \u0111\u1ed5i
cmm.cm_size=K\u00edch th\u01b0\u1edbc
cmm.cm_mimetype=Mimetype
cmm.cm_author=T\u00e1c gi\u1ea3
cmm.cm_taggable=Classifiable
cmm.cm_categories=Danh m\u1ee5c

cmm.form-editor.message.help1=B\u01b0\u1edbc 1 \: K\u00e9o m\u1ed9t ho\u1eb7c nhi\u1ec1u th\u00e0nh ph\u1ea7n b\u1ed1 c\u1ee5c v\u00e0o V\u00f9ng b\u1ed1 tr\u00ed.
cmm.form-editor.message.help2=B\u01b0\u1edbc 2 \: K\u00e9o m\u1ed9t ho\u1eb7c nhi\u1ec1u thu\u1ed9c t\u00ednh v\u00e0o t\u1eebng th\u00e0nh ph\u1ea7n b\u1ed1 c\u1ee5c. Di chu\u1ed9t qua m\u1ed9t y\u1ebfu t\u1ed1 ho\u1eb7c bi\u1ec3u t\u01b0\u1ee3ng thu\u1ed9c t\u00ednh \u0111\u1ec3 s\u1eafp x\u1ebfp l\u1ea1i ho\u1eb7c x\u00f3a n\u00f3. Nh\u1ea5p v\u00e0o m\u1ed9t y\u1ebfu t\u1ed1 ho\u1eb7c ti\u00eau \u0111\u1ec1 thu\u1ed9c t\u00ednh \u0111\u1ec3 ch\u1ec9nh s\u1eeda n\u00f3.
cmm.form-editor.message.help3=B\u01b0\u1edbc 3 \: L\u01b0u b\u1ed1 c\u1ee5c c\u1ee7a b\u1ea1n \! B\u1ea1n lu\u00f4n c\u00f3 th\u1ec3 ch\u1ec9nh s\u1eeda n\u00f3 sau. \u00c1p d\u1ee5ng B\u1ed1 c\u1ee5c m\u1eb7c \u0111\u1ecbnh th\u00eam t\u1ea5t c\u1ea3 c\u00e1c thu\u1ed9c t\u00ednh v\u00e0o m\u1ed9t c\u1ed9t.

cmm.form-editor.palette.heading=Ph\u1ea7n m\u1edf \u0111\u1ea7u
cmm.form-editor.palette.heading.desc=Nh\u1eadp m\u1ed9t ti\u00eau \u0111\u1ec1
cmm.form-editor.palette.heading.def=Th\u00eam ti\u00eau \u0111\u1ec1 c\u1ee7a b\u1ea1n \u1edf \u0111\u00e2y
cmm.form-editor.palette.text=V\u0103n b\u1ea3n
cmm.form-editor.palette.text.desc=Nh\u1eadp m\u1ed9t s\u1ed1 v\u0103n b\u1ea3n
cmm.form-editor.palette.text.def=Th\u00eam v\u0103n b\u1ea3n c\u1ee7a b\u1ea1n \u1edf \u0111\u00e2y
cmm.form-editor.palette.one-column=b\u1ea3ng \u0111i\u1ec1u khi\u1ec3n c\u1ed9t \u0111\u01a1n
cmm.form-editor.palette.two-column-wide-left=b\u1ea3ng \u0111i\u1ec1u khi\u1ec3n c\u1ed9t \u0111\u00f4i b\u00ean tr\u00e1i r\u1ed9ng
cmm.form-editor.palette.two-column=b\u1ea3ng \u0111i\u1ec1u khi\u1ec3n c\u1ed9t \u0111\u00f4i
cmm.form-editor.palette.three-column=b\u1ea3ng \u0111i\u1ec1u khi\u1ec3n ba c\u1ed9t

cmm.form-editor.properties.title=Ch\u1ec9nh s\u1eeda thu\u1ed9c t\u00ednh

cmm.form-editor.property.appearance=Xu\u1ea5t hi\u1ec7n
cmm.form-editor.property.appearance.desc=Ch\u1ecdn s\u1ef1 xu\u1ea5t hi\u1ec7n c\u1ee7a b\u1ea3ng \u0111i\u1ec1u khi\u1ec3n
cmm.form-editor.property.appearance.options.fieldset=Tr\u01b0\u1eddng thi\u1ebft l\u1eadp
cmm.form-editor.property.appearance.options.bordered-panel=B\u1ea3ng \u0111i\u1ec1u khi\u1ec3n gi\u00e1p
cmm.form-editor.property.appearance.options.panel=B\u1ea3ng \u0111i\u1ec1u khi\u1ec3n
cmm.form-editor.property.appearance.options.title=Ti\u00eau \u0111\u1ec1
cmm.form-editor.property.appearance.options.whitespace=Kho\u1ea3ng tr\u1eafng

cmm.form-editor.property.form-control=M\u1eabu \u0111i\u1ec1u khi\u1ec3n
cmm.form-editor.property.form-control.default=M\u1eb7c \u0111\u1ecbnh
cmm.form-editor.property.form-control.desc=Ch\u1ecdn lo\u1ea1i \u0111i\u1ec1u khi\u1ec3n bi\u1ec3u m\u1eabu hi\u1ec3n th\u1ecb cho ng\u01b0\u1eddi d\u00f9ng
cmm.form-editor.property.form-control.checkbox=H\u1ed9p ki\u1ec3m
cmm.form-editor.property.form-control.date=Ng\u00e0y
cmm.form-editor.property.form-control.datetime=Date time
cmm.form-editor.property.form-control.invisible=V\u00f4 h\u00ecnh
cmm.form-editor.property.form-control.number=S\u1ed1
cmm.form-editor.property.form-control.richtext=Rich text
cmm.form-editor.property.form-control.textarea=Text area
cmm.form-editor.property.form-control.textfield=Text field
cmm.form-editor.property.form-control.password=Password field

cmm.form-editor.property.fixed-name=T\u00ean
cmm.form-editor.property.fixed-label=Nh\u00e3n hi\u1ec7u
cmm.form-editor.property.fixed-type=Lo\u1ea1i

cmm.form-editor.property.for-mode=Ch\u1ebf \u0111\u1ed9 xem
cmm.form-editor.property.for-mode.desc=Ch\u1ecdn ch\u1ebf \u0111\u1ed9 xem bi\u1ec3u m\u1eabu \u00e1p d\u1ee5ng
cmm.form-editor.property.for-mode.any=B\u1ea5t k\u1ef3
cmm.form-editor.property.for-mode.view=Xem
cmm.form-editor.property.for-mode.edit=Ch\u1ec9nh s\u1eeda

cmm.form-editor.property.maxlength=\u0110\u1ed9 d\u00e0i t\u1ed1i \u0111a
cmm.form-editor.property.maxlength.desc=\u0110\u1ed9 d\u00e0i \u0111\u1ea7u v\u00e0o t\u1ed1i \u0111a?

cmm.form-editor.property.style=Phong c\u00e1ch
cmm.form-editor.property.style.desc=\ 

cmm.form-editor.property.styleclass=Style class
cmm.form-editor.property.styleclass.desc=Th\u00eam l\u1edbp css c\u1ee7a ri\u00eang b\u1ea1n

cmm.form-editor.property.showtime=Hi\u1ec3n th\u1ecb th\u1eddi gian
cmm.form-editor.property.showtime.desc=T\u00f9y ch\u1ecdn th\u1eddi gian n\u00ean \u0111\u01b0\u1ee3c hi\u1ec3n th\u1ecb?

cmm.form-editor.property.submittime=G\u1eedi th\u1eddi gian
cmm.form-editor.property.submittime.desc=Thay \u0111\u1ed5i t\u00f9y ch\u1ecdn th\u1eddi gian n\u00ean \u0111\u01b0\u1ee3c g\u1eedi?

cmm.form-editor.property.read-only=Ch\u1ec9 \u0111\u1ecdc
cmm.form-editor.property.read-only.desc=\ 

cmm.form-editor.property.force=Bu\u1ed9c hi\u1ec3n th\u1ecb
cmm.form-editor.property.force.desc=\u0110i\u1ec1u n\u00e0y c\u00f3 n\u00ean b\u1ecb bu\u1ed9c ph\u1ea3i \u0111\u01b0\u1ee3c hi\u1ec3n th\u1ecb?

cmm.form-editor.property.hidden=\u1ea8n.
cmm.form-editor.property.hidden.desc=\ 

cmm.form-editor.property.panel-label=Nh\u00e3n hi\u1ec7u
cmm.form-editor.property.panel-label.desc=Th\u00eam nh\u00e3n cho b\u1ea3ng \u0111i\u1ec1u khi\u1ec3n (t\u00f9y ch\u1ecdn)

cmm.form-editor.property.panel-cols=Columns
cmm.form-editor.property.panel-cols.desc=\ 

cmm.form-editor.clear-title=X\u00f3a Tr\u00ecnh thi\u1ebft k\u1ebf b\u1ed1 tr\u00ed
cmm.form-editor.clear-message=B\u1ea1n c\u00f3 ch\u1eafc ch\u1eafn mu\u1ed1n x\u00f3a b\u1ed1 c\u1ee5c hi\u1ec7n t\u1ea1i?
cmm.form-editor.clear-button.confirm-label=X\u00f3a
cmm.form-editor.clear-button.cancel-label=H\u1ee7y b\u1ecf

cmm.form-editor.default-layout-title=\u00c1p d\u1ee5ng b\u1ed1 c\u1ee5c m\u1eb7c \u0111\u1ecbnh
cmm.form-editor.default-layout-message=B\u1ea1n c\u00f3 ch\u1eafc ch\u1eafn mu\u1ed1n \u00e1p d\u1ee5ng b\u1ed1 c\u1ee5c m\u1eb7c \u0111\u1ecbnh?
cmm.form-editor.default-layout-button.confirm-label=\u00c1p d\u1ee5ng
cmm.form-editor.default-layout-button.cancel-label=H\u1ee7y b\u1ecf

cmm.form-editor.message.saved.success=B\u1ed1 c\u1ee5c c\u1ee7a b\u1ea1n \u0111\u00e3 \u0111\u01b0\u1ee3c l\u01b0u th\u00e0nh c\u00f4ng
